#### Terraform fmt for dev `success`
#### Terraform init for dev `success`
#### Terraform validate for dev `success`
#### Terraform plan for dev `success`

<details><summary>Show plan result for dev </summary>

```

provision
proxmox_virtual_environment_vm.dev_vm: Refreshing state... [id=100]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # proxmox_virtual_environment_vm.dev_vm is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "dev_vm" {
      ~ id                      = "100" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:DE:FF:9E",
        ] -> (known after apply)
        name                    = "dev"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        # (19 unchanged attributes hidden)

      ~ cpu {
          + architecture = "x86_64"
          ~ cores        = 1 -> 2
          - flags        = [] -> null
          ~ type         = "qemu64" -> "host"
            # (4 unchanged attributes hidden)
        }

      ~ initialization {
          + datastore_id = "local-lvm"

          + ip_config {
              + ipv4 {
                  + address = "192.168.10.100/24"
                  + gateway = "192.168.10.1"
                }
            }

          - user_account {
              - keys     = [] -> null
              - password = (sensitive value) -> null
              - username = "devops" -> null
            }
        }

      ~ memory {
          ~ dedicated = 2048 -> 8000
            # (2 unchanged attributes hidden)
        }

      ~ network_device {
          ~ mac_address = "BC:24:11:DE:FF:9E" -> (known after apply)
          ~ vlan_id     = 0 -> 10
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @vpletea, Action: `pull_request`*